In [1]:
import pandas as pd

## Q1

In [10]:
print("Enter 5 numbers: ")
l1=[]
for _ in range(5):
    l1.append(int(input()))

series = pd.Series(l1)

Enter 5 numbers:
1
4
6
2
4

In [11]:
series

0    1
1    4
2    6
3    2
4    4
dtype: int64

## Q2

In [22]:
dates = pd.date_range(start='5/1/2021', end='5/12/2021')

In [23]:
dates

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

## Q3

In [27]:
dict1 = {"Name":['Vineeth','Vasu','Anand','Hari','Thyaga'], "Rollno":[1,2,3,4,5]}

dict_df = pd.DataFrame(dict1)

In [28]:
dict_df

      Name  Rollno
0  Vineeth       1
1     Vasu       2
2    Anand       3
3     Hari       4
4   Thyaga       5

## Q4

In [32]:
two_d = [[1,2,3,4,5], ['One','Two','Three','Four','Five'],['I','II','III','IV','V']]

df_twod = pd.DataFrame(two_d)

In [33]:
df_twod

     0    1      2     3     4
0    1    2      3     4     5
1  One  Two  Three  Four  Five
2    I   II    III    IV     V

## Q5

In [34]:
df = pd.read_csv('medal.csv')
df

         Country  Gold_Medal
0  United States          46
1  Great Britain          27
2          China          26
3         Russia          19
4        Germany          17

## Q6

In [50]:
df = pd.DataFrame([[1,2,5],[4,5,6],[6,5,5]], columns=['a','b','c'])
df

   a  b  c
0  1  2  5
1  4  5  6
2  6  5  5

In [49]:
df.sort_values(['b','c'], ascending=(False,True),inplace=True)
df

   a  b  c
2  6  5  5
1  4  5  6
0  1  2  5

## Q7

In [59]:
df = pd.DataFrame([[1,2,5],[4,5,6],[6,5,5]], columns=['a','b','c'])

df.set_index('a',inplace=True)
df

   b  c
a
1  2  5
4  5  6
6  5  5

In [60]:
df.reset_index(inplace=True)
df

   a  b  c
0  1  2  5
1  4  5  6
2  6  5  5

## Q8

In [62]:
df = pd.read_csv('medal.csv')
df.head(2)

         Country  Gold_Medal
0  United States          46
1  Great Britain          27

## Q9

In [67]:
df = pd.DataFrame({'Name':['W','X','Y','Z'],
                  'Occupation':['ABC','ABC','PQR','PQR'],
                  'Salary':[100,120, 80,86]})
df

  Name Occupation  Salary
0    W        ABC     100
1    X        ABC     120
2    Y        PQR      80
3    Z        PQR      86

In [68]:
avg_sal = df.groupby('Occupation').mean()
avg_sal

            Salary
Occupation
ABC          110.0
PQR           83.0

## Q10

In [75]:
df = pd.DataFrame({"Rollno": range(1,6),
                  'Mark': [9,None,7,None,None]})
df

   Rollno  Mark
0       1   9.0
1       2   NaN
2       3   7.0
3       4   NaN
4       5   NaN

In [78]:
df['Mark'].fillna(1,inplace=True)
df

   Rollno  Mark
0       1   9.0
1       2   1.0
2       3   7.0
3       4   1.0
4       5   1.0

## Q11

In [117]:
df = pd.DataFrame({'cname':['X','Y','Z'],
                  'profit':[1,0,1]})
df

  cname  profit
0     X       1
1     Y       0
2     Z       1

In [118]:
df1=df['profit']>0
df['profit']=df1

In [119]:
df

  cname  profit
0     X    True
1     Y   False
2     Z    True

## Q12

In [126]:
df1 = pd.DataFrame({'eid':[1,2,3,4,5],
                   'ename':['V','W','X','Y','Z'],
                   'stipend':[100,101,102,103,104]})
df2 = pd.DataFrame({'eid':[1,2,3,4,5],
                   'designation':['ABC','PQR','ABC','PQR','ABC']})

In [127]:
df1

   eid ename  stipend
0    1     V      100
1    2     W      101
2    3     X      102
3    4     Y      103
4    5     Z      104

In [134]:
df2

   eid designation
0    1         ABC
1    2         PQR
2    3         ABC
3    4         PQR
4    5         ABC

In [138]:
df = df1.merge(df2)
df.rename(columns={'designation':'position'}, inplace=True)
df

   eid ename  stipend position
0    1     V      100      ABC
1    2     W      101      PQR
2    3     X      102      ABC
3    4     Y      103      PQR
4    5     Z      104      ABC